'''

根据应纳税所得额计算税率与速算扣除数

'''

income = int(input("输入应税所得额："))

if income <=36000:
    print("预扣率为：%d%%,速算扣除数为：%d" %(3,5))
elif income <=114000:
    print("预扣率为：%d%%,速算扣除数为：%d" %(10,2520))
elif income <=300000:
    print("预扣率为：%d%%,速算扣除数为：%d" %(20,16920))
elif income <=42000:
    print("预扣率为：%d%%,速算扣除数为：%d" %(25,31920))
elif income <=66000:
    print("预扣率为：%d%%,速算扣除数为：%d" %(30,52920))
elif income <=96000:
    print("预扣率为：%d%%,速算扣除数为：%d" %(35,85920))
else:
    print("预扣率为：%d%%,速算扣除数为：%d" %(45,181920))